root@cloud-comp0-00:~# gdb /usr/sbin/apache2
GNU gdb (Ubuntu 7.11.1-0ubuntu1~16.04) 7.11.1
Copyright (C) 2016 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from /usr/sbin/apache2...(no debugging symbols found)...done.
(gdb) run -k start -X
Starting program: /usr/sbin/apache2 -k start -X
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib/x86_64-linux-gnu/libthread_db.so.1".
<<< DEBUG >>>: top of ShinyCMS.pm
<<< DEBUG >>>: in ShinyCMS.pm, about to use Moose
<<< DEBUG >>>: in ShinyCMS.pm, about to use Catalyst::Runtime
<<< DEBUG >>>: in ShinyCMS.pm, about to use Catalyst
<<< DEBUG >>>: in ShinyCMS.pm, about to use CatalystX::RoleApplicator
<<< DEBUG >>>: in ShinyCMS.pm, about to use Method::Signatures::Simple
<<< DEBUG >>>: in ShinyCMS.pm, about to call config()
<<< DEBUG >>>: in ShinyCMS.pm, have __PACKAGE__ = ShinyCMS
<<< DEBUG >>>: in ShinyCMS.pm, about to call setup()...
<<< DEBUG >>>: in ShinyCMS.pm, returned from setup()
<<< DEBUG >>>: in ShinyCMS.pm, about to return 1

Program received signal SIGSEGV, Segmentation fault.
0x00007fffebabcb10 in ?? ()
(gdb) bt
#0  0x00007fffebabcb10 in ?? ()
#1  0x00007ffff3e5302b in Perl_newUNOP (my_perl=my_perl@entry=0x5555577ddde0, type=type@entry=17, flags=<optimized out>, flags@entry=8192, first=0x5555562141b8) at op.c:4811
#2  0x00007ffff3e54a1d in Perl_newCVREF (my_perl=my_perl@entry=0x5555577ddde0, flags=flags@entry=8192, o=<optimized out>) at op.c:9367
#3  0x00007ffff3e8b686 in Perl_yylex (my_perl=my_perl@entry=0x5555577ddde0) at toke.c:6693
#4  0x00007ffff3e97228 in Perl_yyparse (my_perl=my_perl@entry=0x5555577ddde0, gramtype=gramtype@entry=258) at perly.c:322
#5  0x00007ffff3f21774 in S_doeval (my_perl=my_perl@entry=0x5555577ddde0, gimme=gimme@entry=2, outside=outside@entry=0x0, seq=<optimized out>, hh=hh@entry=0x0) at pp_ctl.c:3491
#6  0x00007ffff3f2c12b in Perl_pp_require (my_perl=0x5555577ddde0) at pp_ctl.c:4176
#7  0x00007ffff3ee2fa6 in Perl_runops_standard (my_perl=0x5555577ddde0) at run.c:41
#8  0x00007ffff3e68206 in Perl_call_sv (my_perl=my_perl@entry=0x5555577ddde0, sv=sv@entry=0x55555c9c4a80, flags=flags@entry=13) at perl.c:2774
#9  0x00007ffff3e6a8a3 in Perl_call_list (my_perl=my_perl@entry=0x5555577ddde0, oldscope=oldscope@entry=13, paramList=0x55555c9c49c0) at perl.c:4990
#10 0x00007ffff3e49cbb in S_process_special_blocks (my_perl=my_perl@entry=0x5555577ddde0, floor=floor@entry=258, fullname=fullname@entry=0x55555c9c83d0 "BEGIN", gv=gv@entry=0x55555c9c4b10, 
    cv=cv@entry=0x55555c9c4a80) at op.c:8891
#11 0x00007ffff3e60d4c in Perl_newATTRSUB_x (my_perl=my_perl@entry=0x5555577ddde0, floor=floor@entry=258, o=<optimized out>, proto=proto@entry=0x0, attrs=attrs@entry=0x0, block=<optimized out>, 
    block@entry=0x55555d7e18d0, o_is_gv=false) at op.c:8820
#12 0x00007ffff3e6484c in Perl_utilize (my_perl=my_perl@entry=0x5555577ddde0, aver=<optimized out>, floor=258, version=<optimized out>, idop=<optimized out>, arg=<optimized out>) at op.c:6043
#13 0x00007ffff3e98b5d in Perl_yyparse (my_perl=my_perl@entry=0x5555577ddde0, gramtype=gramtype@entry=258) at perly.y:351
#14 0x00007ffff3f21774 in S_doeval (my_perl=my_perl@entry=0x5555577ddde0, gimme=gimme@entry=2, outside=outside@entry=0x0, seq=<optimized out>, hh=hh@entry=0x0) at pp_ctl.c:3491
#15 0x00007ffff3f2c12b in Perl_pp_require (my_perl=0x5555577ddde0) at pp_ctl.c:4176
#16 0x00007ffff3ee2fa6 in Perl_runops_standard (my_perl=0x5555577ddde0) at run.c:41
#17 0x00007ffff3e68206 in Perl_call_sv (my_perl=my_perl@entry=0x5555577ddde0, sv=sv@entry=0x55555c9c4858, flags=flags@entry=13) at perl.c:2774
#18 0x00007ffff3e6a8a3 in Perl_call_list (my_perl=my_perl@entry=0x5555577ddde0, oldscope=oldscope@entry=6, paramList=0x55555c9c4738) at perl.c:4990
#19 0x00007ffff3e49cbb in S_process_special_blocks (my_perl=my_perl@entry=0x5555577ddde0, floor=floor@entry=143, fullname=fullname@entry=0x55555c9c83d0 "BEGIN", gv=gv@entry=0x55555c9c47e0, 
    cv=cv@entry=0x55555c9c4858) at op.c:8891
#20 0x00007ffff3e60d4c in Perl_newATTRSUB_x (my_perl=my_perl@entry=0x5555577ddde0, floor=floor@entry=143, o=<optimized out>, proto=proto@entry=0x0, attrs=attrs@entry=0x0, block=<optimized out>, 
    block@entry=0x55555d6fbdf0, o_is_gv=false) at op.c:8820
#21 0x00007ffff3e6484c in Perl_utilize (my_perl=my_perl@entry=0x5555577ddde0, aver=<optimized out>, floor=143, version=<optimized out>, idop=<optimized out>, arg=<optimized out>) at op.c:6043
#22 0x00007ffff3e98b5d in Perl_yyparse (my_perl=my_perl@entry=0x5555577ddde0, gramtype=gramtype@entry=258) at perly.y:351
#23 0x00007ffff3f21774 in S_doeval (my_perl=my_perl@entry=0x5555577ddde0, gimme=gimme@entry=2, outside=outside@entry=0x0, seq=<optimized out>, hh=hh@entry=0x0) at pp_ctl.c:3491
#24 0x00007ffff3f2c12b in Perl_pp_require (my_perl=0x5555577ddde0) at pp_ctl.c:4176
#25 0x00007ffff3ee2fa6 in Perl_runops_standard (my_perl=0x5555577ddde0) at run.c:41
#26 0x00007ffff3e68752 in Perl_eval_sv (my_perl=0x5555577ddde0, sv=0x55555c9c4558, flags=4) at perl.c:2883
#27 0x00007ffff42135d5 in modperl_require_module () from /usr/lib/apache2/modules/mod_perl.so
#28 0x00007ffff420a380 in ?? () from /usr/lib/apache2/modules/mod_perl.so
#29 0x00007ffff3f1dac1 in Perl_leave_scope (my_perl=0x5555577ddde0, base=<optimized out>) at scope.c:1121
#30 0x00007ffff3f1e115 in Perl_pop_scope (my_perl=my_perl@entry=0x5555577ddde0) at scope.c:104
#31 0x00007ffff3e6ef77 in S_parse_body (xsinit=0x7ffff420a280, env=0x0, my_perl=<optimized out>) at perl.c:2325
#32 perl_parse (my_perl=<optimized out>, xsinit=0x7ffff420a280, argc=<optimized out>, argv=<optimized out>, env=0x0) at perl.c:1626
#33 0x00007ffff420aa33 in modperl_startup () from /usr/lib/apache2/modules/mod_perl.so
#34 0x00007ffff420a9c3 in modperl_startup () from /usr/lib/apache2/modules/mod_perl.so
#35 0x00007ffff420ae06 in modperl_init () from /usr/lib/apache2/modules/mod_perl.so
#36 0x00007ffff420af76 in modperl_hook_init () from /usr/lib/apache2/modules/mod_perl.so
#37 0x00007ffff420e514 in modperl_cmd_perldo () from /usr/lib/apache2/modules/mod_perl.so
#38 0x00005555555a83b6 in ?? ()
#39 0x00005555555aab2d in ap_walk_config ()
#40 0x000055555559d2ee in ?? ()
#41 0x00005555555a83b6 in ?? ()
#42 0x00005555555aab2d in ap_walk_config ()
#43 0x00005555555abe5d in ap_process_config_tree ()
#44 0x000055555558709f in main ()
(gdb) start
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Temporary breakpoint 1 at 0x5555555867b0
Starting program: /usr/sbin/apache2 -k start -X
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib/x86_64-linux-gnu/libthread_db.so.1".

Temporary breakpoint 1, 0x00005555555867b0 in main ()
(gdb) break perl_parse
Function "perl_parse" not defined.
Make breakpoint pending on future shared library load? (y or [n]) y
Breakpoint 2 (perl_parse) pending.
(gdb) continue
Continuing.

Breakpoint 2, perl_parse (my_perl=0x55555581ae50, xsinit=0x7ffff420a280, argc=2, argv=0x7ffff7f88070, env=0x0) at perl.c:1473
1473	perl.c: No such file or directory.
(gdb) watch -l PL_check[17]
Hardware watchpoint 3: -location PL_check[17]
(gdb) continue
Continuing.

Hardware watchpoint 3: -location PL_check[17]

Old value = (OP *(*)(PerlInterpreter *, OP *)) 0x7ffff3e4d9e0 <Perl_ck_rvconst>
New value = (OP *(*)(PerlInterpreter *, OP *)) 0x7fffebabcb10 <check_cb>
0x00007fffebabcd0e in hook_op_check (type=type@entry=OP_RV2CV, cb=cb@entry=0x7fffeb8b6d30 <dd_ck_rv2cv>, user_data=user_data@entry=0x0) at Check.xs:66
66			PL_check[type] = check_cb;
(gdb) info threads
  Id   Target Id         Frame 
* 1    Thread 0x7ffff7fe2780 (LWP 6196) "/usr/sbin/apach" 0x00007fffebabcd0e in hook_op_check (type=type@entry=OP_RV2CV, cb=cb@entry=0x7fffeb8b6d30 <dd_ck_rv2cv>, user_data=user_data@entry=0x0)
    at Check.xs:66
(gdb) info source
Current source file is Check.xs
Compilation directory is /home/wbraswell/.cpanm/work/1479735542.24787/B-Hooks-OP-Check-0.19
Located in /home/wbraswell/.cpanm/work/1479735542.24787/B-Hooks-OP-Check-0.19/Check.xs
Contains 106 lines.
Source language is c.
Producer is GNU C11 5.4.0 20160609 -mtune=generic -march=x86-64 -g -O2 -fwrapv -fno-strict-aliasing -fPIC -fstack-protector-strong.
Compiled with DWARF 2 debugging format.
Does not include preprocessor macro info.
(gdb) continue
Continuing.
<<< DEBUG >>>: top of ShinyCMS.pm
<<< DEBUG >>>: in ShinyCMS.pm, about to use Moose
<<< DEBUG >>>: in ShinyCMS.pm, about to use Catalyst::Runtime
<<< DEBUG >>>: in ShinyCMS.pm, about to use Catalyst
<<< DEBUG >>>: in ShinyCMS.pm, about to use CatalystX::RoleApplicator
<<< DEBUG >>>: in ShinyCMS.pm, about to use Method::Signatures::Simple
<<< DEBUG >>>: in ShinyCMS.pm, about to call config()
<<< DEBUG >>>: in ShinyCMS.pm, have __PACKAGE__ = ShinyCMS
<<< DEBUG >>>: in ShinyCMS.pm, about to call setup()...
<<< DEBUG >>>: in ShinyCMS.pm, returned from setup()
<<< DEBUG >>>: in ShinyCMS.pm, about to return 1

Breakpoint 2, perl_parse (my_perl=0x555559dd8ed0, xsinit=0x7ffff420a280, argc=2, argv=0x7ffff7f84070, env=0x0) at perl.c:1473
1473	perl.c: No such file or directory.
(gdb) continue
Continuing.

Program received signal SIGSEGV, Segmentation fault.
0x00007fffebabcb10 in ?? ()
(gdb) bt
#0  0x00007fffebabcb10 in ?? ()
#1  0x00007ffff3e5302b in Perl_newUNOP (my_perl=my_perl@entry=0x555559dd8ed0, type=type@entry=17, flags=<optimized out>, flags@entry=8192, first=0x55555824eb98) at op.c:4811
#2  0x00007ffff3e54a1d in Perl_newCVREF (my_perl=my_perl@entry=0x555559dd8ed0, flags=flags@entry=8192, o=<optimized out>) at op.c:9367
#3  0x00007ffff3e8b686 in Perl_yylex (my_perl=my_perl@entry=0x555559dd8ed0) at toke.c:6693
#4  0x00007ffff3e97228 in Perl_yyparse (my_perl=my_perl@entry=0x555559dd8ed0, gramtype=gramtype@entry=258) at perly.c:322
#5  0x00007ffff3f21774 in S_doeval (my_perl=my_perl@entry=0x555559dd8ed0, gimme=gimme@entry=2, outside=outside@entry=0x0, seq=<optimized out>, hh=hh@entry=0x0) at pp_ctl.c:3491
#6  0x00007ffff3f2c12b in Perl_pp_require (my_perl=0x555559dd8ed0) at pp_ctl.c:4176
#7  0x00007ffff3ee2fa6 in Perl_runops_standard (my_perl=0x555559dd8ed0) at run.c:41
#8  0x00007ffff3e68206 in Perl_call_sv (my_perl=my_perl@entry=0x555559dd8ed0, sv=sv@entry=0x55555c9fd600, flags=flags@entry=13) at perl.c:2774
#9  0x00007ffff3e6a8a3 in Perl_call_list (my_perl=my_perl@entry=0x555559dd8ed0, oldscope=oldscope@entry=13, paramList=0x55555c9fd540) at perl.c:4990
#10 0x00007ffff3e49cbb in S_process_special_blocks (my_perl=my_perl@entry=0x555559dd8ed0, floor=floor@entry=258, fullname=fullname@entry=0x55555ca00000 "BEGIN", gv=gv@entry=0x55555c9fd690, 
    cv=cv@entry=0x55555c9fd600) at op.c:8891
#11 0x00007ffff3e60d4c in Perl_newATTRSUB_x (my_perl=my_perl@entry=0x555559dd8ed0, floor=floor@entry=258, o=<optimized out>, proto=proto@entry=0x0, attrs=attrs@entry=0x0, block=<optimized out>, 
    block@entry=0x55555c9ff910, o_is_gv=false) at op.c:8820
#12 0x00007ffff3e6484c in Perl_utilize (my_perl=my_perl@entry=0x555559dd8ed0, aver=<optimized out>, floor=258, version=<optimized out>, idop=<optimized out>, arg=<optimized out>) at op.c:6043
#13 0x00007ffff3e98b5d in Perl_yyparse (my_perl=my_perl@entry=0x555559dd8ed0, gramtype=gramtype@entry=258) at perly.y:351
#14 0x00007ffff3f21774 in S_doeval (my_perl=my_perl@entry=0x555559dd8ed0, gimme=gimme@entry=2, outside=outside@entry=0x0, seq=<optimized out>, hh=hh@entry=0x0) at pp_ctl.c:3491
#15 0x00007ffff3f2c12b in Perl_pp_require (my_perl=0x555559dd8ed0) at pp_ctl.c:4176
#16 0x00007ffff3ee2fa6 in Perl_runops_standard (my_perl=0x555559dd8ed0) at run.c:41
#17 0x00007ffff3e68206 in Perl_call_sv (my_perl=my_perl@entry=0x555559dd8ed0, sv=sv@entry=0x55555c9fd3d8, flags=flags@entry=13) at perl.c:2774
#18 0x00007ffff3e6a8a3 in Perl_call_list (my_perl=my_perl@entry=0x555559dd8ed0, oldscope=oldscope@entry=6, paramList=0x55555c9fd2b8) at perl.c:4990
#19 0x00007ffff3e49cbb in S_process_special_blocks (my_perl=my_perl@entry=0x555559dd8ed0, floor=floor@entry=143, fullname=fullname@entry=0x55555ca00000 "BEGIN", gv=gv@entry=0x55555c9fd360, 
    cv=cv@entry=0x55555c9fd3d8) at op.c:8891
#20 0x00007ffff3e60d4c in Perl_newATTRSUB_x (my_perl=my_perl@entry=0x555559dd8ed0, floor=floor@entry=143, o=<optimized out>, proto=proto@entry=0x0, attrs=attrs@entry=0x0, block=<optimized out>, 
    block@entry=0x55555c9f5f00, o_is_gv=false) at op.c:8820
#21 0x00007ffff3e6484c in Perl_utilize (my_perl=my_perl@entry=0x555559dd8ed0, aver=<optimized out>, floor=143, version=<optimized out>, idop=<optimized out>, arg=<optimized out>) at op.c:6043
#22 0x00007ffff3e98b5d in Perl_yyparse (my_perl=my_perl@entry=0x555559dd8ed0, gramtype=gramtype@entry=258) at perly.y:351
#23 0x00007ffff3f21774 in S_doeval (my_perl=my_perl@entry=0x555559dd8ed0, gimme=gimme@entry=2, outside=outside@entry=0x0, seq=<optimized out>, hh=hh@entry=0x0) at pp_ctl.c:3491
#24 0x00007ffff3f2c12b in Perl_pp_require (my_perl=0x555559dd8ed0) at pp_ctl.c:4176
#25 0x00007ffff3ee2fa6 in Perl_runops_standard (my_perl=0x555559dd8ed0) at run.c:41
#26 0x00007ffff3e68752 in Perl_eval_sv (my_perl=0x555559dd8ed0, sv=0x55555c9fd0d8, flags=4) at perl.c:2883
#27 0x00007ffff42135d5 in modperl_require_module () from /usr/lib/apache2/modules/mod_perl.so
#28 0x00007ffff420a380 in ?? () from /usr/lib/apache2/modules/mod_perl.so
#29 0x00007ffff3f1dac1 in Perl_leave_scope (my_perl=0x555559dd8ed0, base=<optimized out>) at scope.c:1121
#30 0x00007ffff3f1e115 in Perl_pop_scope (my_perl=my_perl@entry=0x555559dd8ed0) at scope.c:104
#31 0x00007ffff3e6ef77 in S_parse_body (xsinit=0x7ffff420a280, env=0x0, my_perl=<optimized out>) at perl.c:2325
#32 perl_parse (my_perl=<optimized out>, xsinit=0x7ffff420a280, argc=<optimized out>, argv=<optimized out>, env=0x0) at perl.c:1626
#33 0x00007ffff420aa33 in modperl_startup () from /usr/lib/apache2/modules/mod_perl.so
#34 0x00007ffff420a9c3 in modperl_startup () from /usr/lib/apache2/modules/mod_perl.so
#35 0x00007ffff420ae06 in modperl_init () from /usr/lib/apache2/modules/mod_perl.so
#36 0x00007ffff420af76 in modperl_hook_init () from /usr/lib/apache2/modules/mod_perl.so
#37 0x00007ffff420e514 in modperl_cmd_perldo () from /usr/lib/apache2/modules/mod_perl.so
#38 0x00005555555a83b6 in ?? ()
#39 0x00005555555aab2d in ap_walk_config ()
#40 0x000055555559d2ee in ?? ()
#41 0x00005555555a83b6 in ?? ()
#42 0x00005555555aab2d in ap_walk_config ()
#43 0x00005555555abe5d in ap_process_config_tree ()
#44 0x000055555558709f in main ()
(gdb) print PL_check[17]
$1 = (Perl_check_t) 0x7fffebabcb10
(gdb) quit
A debugging session is active.

	Inferior 1 [process 6196] will be killed.

Quit anyway? (y or n) y
root@cloud-comp0-00:~# 

