
Validating the user input credentials & PRET test against the server ...

Net-FTPSSL Version: 0.23

Perl: 5.012001  [5.12.1],  OS: linux

Server (port): 142.168.64.140 (2222)

Keys: (Trace), (Debug), (Encryption), (Port), (Timeout), (useSSL), (DataProtLevel)
Values: (1), (1), (I), (2222), (121), (0), (C)

<<< 220-FileZilla Server version 0.9.41 beta
<<< 220-written by Tim Kosse (Tim.Kosse@gmx.de)
<<< 220 Please visit http://sourceforge.net/projects/filezilla/
>>> USER +++++++
<<< 331 Password required for <++++++>
>>> PASS *******
<<< 230 Logged on
>>> HELP
<<< 214-The following commands are recognized:
<<<    USER   PASS   QUIT   CWD    PWD    PORT   PASV   TYPE
<<<    LIST   REST   CDUP   RETR   STOR   SIZE   DELE   RMD 
<<<    MKD    RNFR   RNTO   ABOR   SYST   NOOP   APPE   NLST
<<<    MDTM   XPWD   XCUP   XMKD   XRMD   NOP    EPSV   EPRT
<<<    AUTH   ADAT   PBSZ   PROT   FEAT   MODE   OPTS   HELP
<<<    ALLO   MLST   MLSD   SITE   P@SW   STRU   CLNT   MFMT
<<<    HASH
<<< 214 Have a nice day.
>>> FEAT
<<< 211-Features:
<<<  MDTM
<<<  REST STREAM
<<<  SIZE
<<<  MLST type*;size*;modify*;
<<<  MLSD
<<<  AUTH SSL
<<<  AUTH TLS
<<<  PROT
<<<  PBSZ
<<<  UTF8
<<<  CLNT
<<<  MFMT
<<< 211 End
<<+ 214 The HELP command is supported.
>>> PRET LIST
<<< 500 Syntax error, command unrecognized.
>>> QUIT
<<< 221 Goodbye

Trying to determine if HELP works on encrypted channels ...

Net-FTPSSL Version: 0.23

Perl: 5.012001  [5.12.1],  OS: linux

Server (port): 142.168.64.140 (2222)

Keys: (Trace), (Debug), (Encryption), (Port), (Timeout), (useSSL), (DataProtLevel)
Values: (1), (1), (I), (2222), (121), (0), (C)

<<< 220-FileZilla Server version 0.9.41 beta
<<< 220-written by Tim Kosse (Tim.Kosse@gmx.de)
<<< 220 Please visit http://sourceforge.net/projects/filezilla/
>>> USER +++++++
<<< 331 Password required for <++++++>
>>> PASS *******
<<< 230 Logged on
>>> HELP
<<< 214-The following commands are recognized:
<<<    USER   PASS   QUIT   CWD    PWD    PORT   PASV   TYPE
<<<    LIST   REST   CDUP   RETR   STOR   SIZE   DELE   RMD 
<<<    MKD    RNFR   RNTO   ABOR   SYST   NOOP   APPE   NLST
<<<    MDTM   XPWD   XCUP   XMKD   XRMD   NOP    EPSV   EPRT
<<<    AUTH   ADAT   PBSZ   PROT   FEAT   MODE   OPTS   HELP
<<<    ALLO   MLST   MLSD   SITE   P@SW   STRU   CLNT   MFMT
<<<    HASH
<<< 214 Have a nice day.
>>> FEAT
<<< 211-Features:
<<<  MDTM
<<<  REST STREAM
<<<  SIZE
<<<  MLST type*;size*;modify*;
<<<  MLSD
<<<  AUTH SSL
<<<  AUTH TLS
<<<  PROT
<<<  PBSZ
<<<  UTF8
<<<  CLNT
<<<  MFMT
<<< 211 End
<<+ 214 The HELP command is supported.
>>> NOOP
<<< 200 OK
>>> HELP
<<< 214-The following commands are recognized:
<<<    USER   PASS   QUIT   CWD    PWD    PORT   PASV   TYPE
<<<    LIST   REST   CDUP   RETR   STOR   SIZE   DELE   RMD 
<<<    MKD    RNFR   RNTO   ABOR   SYST   NOOP   APPE   NLST
<<<    MDTM   XPWD   XCUP   XMKD   XRMD   NOP    EPSV   EPRT
<<<    AUTH   ADAT   PBSZ   PROT   FEAT   MODE   OPTS   HELP
<<<    ALLO   MLST   MLSD   SITE   P@SW   STRU   CLNT   MFMT
<<<    HASH
<<< 214 Have a nice day.
>>> QUIT
<<< 221 Goodbye

Trying to determine if PASV returns wrong IP Address ...

Net-FTPSSL Version: 0.23

Perl: 5.012001  [5.12.1],  OS: linux

Server (port): 142.168.64.140 (2222)

Keys: (Trace), (Debug), (Encryption), (Port), (Timeout), (useSSL), (DataProtLevel)
Values: (1), (1), (I), (2222), (121), (0), (C)

<<< 220-FileZilla Server version 0.9.41 beta
<<< 220-written by Tim Kosse (Tim.Kosse@gmx.de)
<<< 220 Please visit http://sourceforge.net/projects/filezilla/
>>> USER +++++++
<<< 331 Password required for <++++++>
>>> PASS *******
<<< 230 Logged on
>>> HELP
<<< 214-The following commands are recognized:
<<<    USER   PASS   QUIT   CWD    PWD    PORT   PASV   TYPE
<<<    LIST   REST   CDUP   RETR   STOR   SIZE   DELE   RMD 
<<<    MKD    RNFR   RNTO   ABOR   SYST   NOOP   APPE   NLST
<<<    MDTM   XPWD   XCUP   XMKD   XRMD   NOP    EPSV   EPRT
<<<    AUTH   ADAT   PBSZ   PROT   FEAT   MODE   OPTS   HELP
<<<    ALLO   MLST   MLSD   SITE   P@SW   STRU   CLNT   MFMT
<<<    HASH
<<< 214 Have a nice day.
>>> FEAT
<<< 211-Features:
<<<  MDTM
<<<  REST STREAM
<<<  SIZE
<<<  MLST type*;size*;modify*;
<<<  MLSD
<<<  AUTH SSL
<<<  AUTH TLS
<<<  PROT
<<<  PBSZ
<<<  UTF8
<<<  CLNT
<<<  MFMT
<<< 211 End
<<+ 214 The HELP command is supported.
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,160)
Calling _open_data_channel (142.168.64.140, 4000)
>>> ABOR
<<< 226 ABOR command successful
>>> QUIT
<<< 221 Goodbye

PASV works fine ...

**** Starting the real server test ****

Net-FTPSSL Version: 0.23

Perl: 5.012001  [5.12.1],  OS: linux

Server (port): 142.168.64.140 (2222)

Keys: (Croak), (Trace), (Debug), (Encryption), (PreserveTimestamp), (Port), (Timeout), (useSSL), (DataProtLevel)
Values: (1), (1), (1), (I), (1), (2222), (121), (0), (C)

<<< 220-FileZilla Server version 0.9.41 beta
<<< 220-written by Tim Kosse (Tim.Kosse@gmx.de)
<<< 220 Please visit http://sourceforge.net/projects/filezilla/
>>> USER +++++++
<<< 331 Password required for <++++++>
>>> PASS *******
<<< 230 Logged on
>>> HELP
<<< 214-The following commands are recognized:
<<<    USER   PASS   QUIT   CWD    PWD    PORT   PASV   TYPE
<<<    LIST   REST   CDUP   RETR   STOR   SIZE   DELE   RMD 
<<<    MKD    RNFR   RNTO   ABOR   SYST   NOOP   APPE   NLST
<<<    MDTM   XPWD   XCUP   XMKD   XRMD   NOP    EPSV   EPRT
<<<    AUTH   ADAT   PBSZ   PROT   FEAT   MODE   OPTS   HELP
<<<    ALLO   MLST   MLSD   SITE   P@SW   STRU   CLNT   MFMT
<<<    HASH
<<< 214 Have a nice day.
>>> FEAT
<<< 211-Features:
<<<  MDTM
<<<  REST STREAM
<<<  SIZE
<<<  MLST type*;size*;modify*;
<<<  MLSD
<<<  AUTH SSL
<<<  AUTH TLS
<<<  PROT
<<<  PBSZ
<<<  UTF8
<<<  CLNT
<<<  MFMT
<<< 211 End
<<+ 214 The HELP command is supported.
<<+ 214 The MFMT command is supported.
<<+ 214 The MDTM command is supported.
>>> PWD
<<< 257 "/" is current directory.

Creating secondary connections for other log files ...
------------- Found 6 file(s) -----------------
(drwxr-xr-x 1 ftp ftp              0 Nov 20  2012 getDir)
(drwxr-xr-x 1 ftp ftp              0 Nov 19  2012 mgetDir)
(drwxr-xr-x 1 ftp ftp              0 Dec 18  2012 putDir)
(-rw-r--r-- 1 ftp ftp           2310 Mar 23  2012 wm712.txt)
(-rw-r--r-- 1 ftp ftp             28 Apr 24  2012 wm712_back.txt)
...
(SUB-TEST-LIST-RESULTS-FROM-OTHER-SECTION)
-----------------------------------------------
End of secondary connections for other log files ...

>>> CWD /
<<< 250 CWD successful. "/" is current directory.
>>> PWD
<<< 257 "/" is current directory.
>>> CDUP
<<< 200 CDUP successful. "/" is current directory.
>>> PWD
<<< 257 "/" is current directory.
>>> CWD /
<<< 250 CWD successful. "/" is current directory.
>>> PWD
<<< 257 "/" is current directory.
<<+ 214 The HELP command is supported.
>>> HELP HELP
<<< 214 Command HELP is supported by FileZilla Server
--- 214 Command HELP is supported by FileZilla Server ---
--- 214 Command HELP is supported by FileZilla Server -- (cached?) --
<<+ 214 The HELP command is supported.
<<+ 502 Unknown command BADCMD.
>>> HELP SITE
<<< 214 Command SITE is supported by FileZilla Server
<<+ 502 Unknown SITE sub-command - BADCMD.
>>> HELP BADCMD
<<< 502 Command BADCMD is not recognized or supported by FileZilla Server
>>> HELP SITE
<<< 214 Command SITE is supported by FileZilla Server
>>> NOOP
<<< 200 OK
<<+ 214 The MFMT command is supported.
<<+ 214 The MDTM command is supported.
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,162)
--- Host (142.168.64.140)  Port (4002)
<<+ 214 The ALLO command is supported.
>>> ALLO 113680
<<< 202 No storage allocation neccessary.
>>> STOR FTPSSL.pm
<<< 150 Connection accepted
put() trace ..... done! (113,680 byte(s))
<<< 226 Transfer OK
>>> MFMT 20130207221726 FTPSSL.pm
<<< 213 modify=20130207221726; /FTPSSL.pm
<<+ 502 Unknown command STOU.
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,163)
--- Host (142.168.64.140)  Port (4003)
<<+ 214 The ALLO command is supported.
>>> ALLO 113680
<<< 202 No storage allocation neccessary.
>>> STOU FTPSSL.pm
<<< 500 Syntax error, command unrecognized.
>>> TYPE I
<<< 200 Type set to I
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,164)
--- Host (142.168.64.140)  Port (4004)
<<+ 214 The ALLO command is supported.
>>> ALLO 7787
<<< 202 No storage allocation neccessary.
>>> STOR test_file.tar.gz
<<< 150 Connection accepted
put() trace ... done! (7,787 byte(s))
<<< 226 Transfer OK
>>> MFMT 20121115152043 test_file.tar.gz
<<< 213 modify=20121115152043; /test_file.tar.gz
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,165)
--- Host (142.168.64.140)  Port (4005)
>>> LIST
<<< 150 Connection accepted
<<< 226 Transfer OK
------------- Found 7 file(s) -----------------
(-rw-r--r-- 1 ftp ftp         116956 Feb 07 17:10 FTPSSL.pm)
(drwxr-xr-x 1 ftp ftp              0 Nov 20  2012 getDir)
(drwxr-xr-x 1 ftp ftp              0 Nov 19  2012 mgetDir)
(drwxr-xr-x 1 ftp ftp              0 Dec 18  2012 putDir)
(-rw-r--r-- 1 ftp ftp           7787 Nov 15  2012 test_file.tar.gz)
...
(-rw-r--r-- 1 ftp ftp             28 Apr 24  2012 wm712_back.txt)
-----------------------------------------------
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,160)
--- Host (142.168.64.140)  Port (4000)
>>> LIST
<<< 150 Connection accepted
<<< 226 Transfer OK
------------- Found 7 file(s) -----------------
(-RW-R--R-- 1 FTP FTP         116,956 FEB 07 17:10 FTPSSL.PM)
(DRWXR-XR-X 1 FTP FTP              0 NOV 20  2,012 GETDIR)
(DRWXR-XR-X 1 FTP FTP              0 NOV 19  2,012 MGETDIR)
(DRWXR-XR-X 1 FTP FTP              0 DEC 18  2,012 PUTDIR)
(-RW-R--R-- 1 FTP FTP           7,787 NOV 15  2,012 TEST_FILE.TAR.GZ)
...
(-RW-R--R-- 1 FTP FTP             28 APR 24  2,012 WM712_BACK.TXT)
-----------------------------------------------
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,161)
--- Host (142.168.64.140)  Port (4001)
>>> LIST
<<< 150 Connection accepted
<<< 226 Transfer OK
PATTERN: <- *.p? => \s+(\S*\.p.)($|\s+->\s+) ->
------------- Found 1 file(s) -----------------
(-rw-r--r-- 1 ftp ftp         116956 Feb 07 17:10 FTPSSL.pm)
-----------------------------------------------
>>> RNFR test_file.tar.gz
<<< 350 File exists, ready for destination name.
>>> RNTO test_file_new.tar.gz
<<< 250 file renamed successfully
<<+ 214 The RNFR command is supported.
<<+ 214 The RNTO command is supported.
>>> TYPE A
<<< 200 Type set to A
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,162)
--- Host (142.168.64.140)  Port (4002)
<<+ 214 The ALLO command is supported.
>>> ALLO 113680
<<< 202 No storage allocation neccessary.
>>> STOR ./_tmp.dapgwuu1.17162.tmp
<<< 150 Connection accepted
xput() trace ..... done! (113,680 byte(s))
<<< 226 Transfer OK
>>> DELE ./ZapMe.pm
<<< 550 File not found
>>> RNFR ./_tmp.dapgwuu1.17162.tmp
<<< 350 File exists, ready for destination name.
>>> RNTO ./ZapMe.pm
<<< 250 file renamed successfully
>>> MFMT 20130207221726 ./ZapMe.pm
<<< 213 modify=20130207221726; /ZapMe.pm
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,163)
--- Host (142.168.64.140)  Port (4003)
<<+ 214 The ALLO command is supported.
>>> ALLO 113680
<<< 202 No storage allocation neccessary.
>>> STOR _tmp.dapgwuu1.17162.tmp
<<< 150 Connection accepted
xput() trace ..... done! (113,680 byte(s))
<<< 226 Transfer OK
>>> DELE ZapMe2.pm
<<< 550 File not found
>>> RNFR _tmp.dapgwuu1.17162.tmp
<<< 350 File exists, ready for destination name.
>>> RNTO ZapMe2.pm
<<< 250 file renamed successfully
>>> MFMT 20130207221726 ZapMe2.pm
<<< 213 modify=20130207221726; /ZapMe2.pm
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,164)
--- Host (142.168.64.140)  Port (4004)
>>> NLST
<<< 150 Connection accepted
<<< 226 Transfer OK
------------- Found 14 file(s) -----------------
([1]: FTPSSL.PM)
([2]: GETDIR)
([3]: MGETDIR)
([4]: PUTDIR)
([5]: TEST_FILE_NEW.TAR.GZ)
...
([14]: Horse & Buggy!)
-----------------------------------------------
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,165)
--- Host (142.168.64.140)  Port (4005)
>>> NLST
<<< 150 Connection accepted
<<< 226 Transfer OK
------------- Found 9 file(s) -----------------
(FTPSSL.pm)
(getDir)
(mgetDir)
(putDir)
(test_file_new.tar.gz)
...
(ZapMe2.pm)
-----------------------------------------------
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,160)
--- Host (142.168.64.140)  Port (4000)
>>> NLST
<<< 150 Connection accepted
<<< 226 Transfer OK
PATTERN: <- *.p? => (^|[\\/])[^\\/]*\.p.$ ->
------------- Found 3 file(s) -----------------
(FTPSSL.pm)
(ZapMe.pm)
(ZapMe2.pm)
-----------------------------------------------
>>> DELE ZapMe.pm
<<< 250 File deleted successfully
>>> DELE ZapMe2.pm
<<< 250 File deleted successfully
>>> TYPE I
<<< 200 Type set to I
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,161)
--- Host (142.168.64.140)  Port (4001)
>>> RETR test_file_new.tar.gz
<<< 150 Connection accepted
get() trace .... done! (7,787 byte(s))
<<< 226 Transfer OK
>>> MDTM test_file_new.tar.gz
<<< 213 20121115152043
>>> SIZE test_file_new.tar.gz
<<< 213 7787
>>> DELE test_file_new.tar.gz
<<< 250 File deleted successfully
>>> TYPE A
<<< 200 Type set to A
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,162)
--- Host (142.168.64.140)  Port (4002)
>>> RETR FTPSSL.pm
<<< 150 Connection accepted
xget() trace ..................... done! (113,680 byte(s))
<<< 226 Transfer OK
>>> MDTM FTPSSL.pm
<<< 213 20130207221726
<<+ renamed ./t/_tmp.1uuwgpad.17162.tmp to ./t/FTPSSL.pm_new.tst
>>> DELE FTPSSL.pm
<<< 250 File deleted successfully
>>> PBSZ 0
<<< 200 PBSZ=0
>>> PROT C
<<< 200 Protection level set to C
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,163)
--- Host (142.168.64.140)  Port (4003)
>>> RETR delete_me_I_do_not_exist.txt
<<< 550 File not found
 *** No local copy was created!
<<+ 502 Unknown command CCC.
>>> NOOP
<<< 200 OK
>>> PWD
<<< 257 "/" is current directory.
>>> QUIT
<<< 221 Goodbye
