
Net-FTPSSL Version: 0.19

Perl: 5.008008  [5.8.8],  OS: linux

Server (port): ftp.storesonlinepro.com (990)

<<< 220 FTP Server Ready
>>> USER +++++++
<<< 3
>>> PASS *******
<<< 31 User name accepted, password required.
>>> TYPE I
<<< 2
>>> CWD /uploaded/links
<<< 30-Welcome 3936692
<<< 230 
>>> PWD
<<< 2
>>> PBSZ 0
<<< 00 Type set to I.
>>> PROT P
<<< 2
>>> PASV
<<< 50 CWD command successful.
--- Host ()  Port ()
<<+ 214 The ALLO command is supported.
>>> ALLO 20653
<<< 2
>>> STOR add_link.html
<<< 57 "/uploaded/links/" is the current directory.
>>> PBSZ 0
<<< 2
>>> PROT P
<<< 00 Protection Buffer Size set: 0.
>>> PBSZ 0
<<< 2
>>> PROT P
<<< 00 Protection Levet set: P.
>>> PBSZ 0
<<< 2
>>> PROT P
<<< 27 Entering passive mode (10,5,3,130,232,190).
>>> PASV
<<< 4
--- Host ()  Port ()
<<+ 214 The ALLO command is supported.
>>> ALLO 3010
<<< 25 Can't build data connection.
>>> STOR clothing-and-accessories.html
<<< 5
>>> PBSZ 0
<<< 00 'ALLO': command not understood.
>>> PROT P
<<< 1
>>> PBSZ 0
<<< 50 Opening BINARY mode data connection for add_link.html.
>>> PROT P
<<< 2
>>> PASV
<<< 26 Transfer complete.
<<+ 555 Can't parse the PASV response.
--- Host ()  Port ()
<<+ 214 The ALLO command is supported.
>>> ALLO 3005
<<< 2
>>> STOR gifts-gadgets-and-toys.html
<<< 00 Protection Buffer Size set: 0.
>>> PBSZ 0
<<< 2
>>> PROT P
<<< 00 Protection Levet set: P.
>>> PBSZ 0
<<< 2
>>> PROT P
<<< 00 Protection Buffer Size set: 0.
>>> PBSZ 0
<<< 2
>>> PROT P
<<< 00 Protection Levet set: P.
>>> PBSZ 0
<<< 2
>>> PROT P
<<< 00 Protection Buffer Size set: 0.
>>> PBSZ 0
<<< 2
>>> PROT P
<<< 00 Protection Levet set: P.
>>> PBSZ 0
<<< 2
>>> PROT P
<<< 27 Entering passive mode (10,5,3,130,232,191).
>>> PASV
<<< 4
--- Host ()  Port ()
<<+ 214 The ALLO command is supported.
>>> ALLO 3010
<<< 25 Can't build data connection.
>>> STOR travel-and-entertainment.html
<<< 5
>>> PBSZ 0
<<< 00 'ALLO': command not understood.
>>> PROT P
<<< 1
>>> QUIT
<<< 50 Opening BINARY mode data connection for clothing-and-accessories.html.
