
Validating the user input credentials & PRET test against the server ...

Net-FTPSSL Version: 0.23

Perl: 5.012001  [5.12.1],  OS: linux

Server (port): 142.168.64.140 (2221)

Keys: (ProxyArgs), (Trace), (Debug), (Encryption), (Port), (Timeout), (useSSL), (DataProtLevel)
Values: (HASH(0xd32c780)), (1), (1), (C), (2221), (121), (0), ()

SKT <<< 220-FileZilla Server version 0.9.41 beta
SKT <<< 220-written by Tim Kosse (Tim.Kosse@gmx.de)
SKT <<< 220 Please visit http://sourceforge.net/projects/filezilla/
>>> USER +++++++
<<< 331 Password required for <++++++>
>>> PASS *******
<<< 230 Logged on
>>> HELP
<<< 214-The following commands are recognized:
<<<    USER   PASS   QUIT   CWD    PWD    PORT   PASV   TYPE
<<<    LIST   REST   CDUP   RETR   STOR   SIZE   DELE   RMD 
<<<    MKD    RNFR   RNTO   ABOR   SYST   NOOP   APPE   NLST
<<<    MDTM   XPWD   XCUP   XMKD   XRMD   NOP    EPSV   EPRT
<<<    AUTH   ADAT   PBSZ   PROT   FEAT   MODE   OPTS   HELP
<<<    ALLO   MLST   MLSD   SITE   P@SW   STRU   CLNT   MFMT
<<<    HASH
<<< 214 Have a nice day.
>>> FEAT
<<< 211-Features:
<<<  MDTM
<<<  REST STREAM
<<<  SIZE
<<<  MLST type*;size*;modify*;
<<<  MLSD
<<<  AUTH SSL
<<<  AUTH TLS
<<<  PROT
<<<  PBSZ
<<<  UTF8
<<<  CLNT
<<<  MFMT
<<< 211 End
<<+ 214 The HELP command is supported.
>>> PRET LIST
<<< 500 Syntax error, command unrecognized.
>>> QUIT
<<< 221 Goodbye

Trying to determine if PASV returns wrong IP Address ...

Net-FTPSSL Version: 0.23

Perl: 5.012001  [5.12.1],  OS: linux

Server (port): 142.168.64.140 (2221)

Keys: (ProxyArgs), (Trace), (Debug), (Encryption), (Port), (Timeout), (useSSL), (DataProtLevel)
Values: (HASH(0xd32c780)), (1), (1), (C), (2221), (121), (0), ()

SKT <<< 220-FileZilla Server version 0.9.41 beta
SKT <<< 220-written by Tim Kosse (Tim.Kosse@gmx.de)
SKT <<< 220 Please visit http://sourceforge.net/projects/filezilla/
>>> USER +++++++
<<< 331 Password required for <++++++>
>>> PASS *******
<<< 230 Logged on
>>> HELP
<<< 214-The following commands are recognized:
<<<    USER   PASS   QUIT   CWD    PWD    PORT   PASV   TYPE
<<<    LIST   REST   CDUP   RETR   STOR   SIZE   DELE   RMD 
<<<    MKD    RNFR   RNTO   ABOR   SYST   NOOP   APPE   NLST
<<<    MDTM   XPWD   XCUP   XMKD   XRMD   NOP    EPSV   EPRT
<<<    AUTH   ADAT   PBSZ   PROT   FEAT   MODE   OPTS   HELP
<<<    ALLO   MLST   MLSD   SITE   P@SW   STRU   CLNT   MFMT
<<<    HASH
<<< 214 Have a nice day.
>>> FEAT
<<< 211-Features:
<<<  MDTM
<<<  REST STREAM
<<<  SIZE
<<<  MLST type*;size*;modify*;
<<<  MLSD
<<<  AUTH SSL
<<<  AUTH TLS
<<<  PROT
<<<  PBSZ
<<<  UTF8
<<<  CLNT
<<<  MFMT
<<< 211 End
<<+ 214 The HELP command is supported.
>>> PASV
<<< 227 Entering Passive Mode (142,168,64,140,15,161)
Calling _open_data_channel (142.168.64.140, 4001)
Can't use an undefined value as a HASH reference at /home/rdenault/mnt/projects/perlModules/Net-FTPSSL/blib/lib/Net/FTPSSL.pm line 563, <GEN1> line 2.
